"Maye Musk appeared at the end of her Tesla CEO son's SNL monologue to ask what he got her for Mother's Day.\"I'm excited for my Mother's Day gift,\" Maye Musk said. \"I just hope it's not dogecoin!\"\"It is,\" Elon Musk said. \"It sure is.\"Musk later played a character on SNL's Weekend Update segment, who struggled to explain what dogecoin was -- ultimately admitting it's just \"a hustle.\"After pumping up the value of the cryptocurrency in the lead-up to Musk's SNL appearance, investors sold off dogecoin sharply after the Musks talked about it on the show. Dogecoin was down 40%, trading as low as 44 cents early Sunday. The cryptocurrency started Saturday trading at around 70 cents and was selling for about 66 cents just before SNL went on the air at 11:30 pm ET.Cryptocurrencies are notoriously volatile, and dogecoin has been on an absolute tear this year. It's up more than 12,000% since January and has gained 800% this month alone.Musk has been the loudest and most prominent supporter of dogecoin. He frequently tweets about the cryptocurrency, and just one of his bizarre tweets to his 50 million followers can send dogecoin surging. That's what happened in April, when Musk tweeted \"Doge Barking at the moon\" and shared a photo of a painting by Spanish artist Joan Miró, which is titled \"Dog Barking at the Moon.\"Dogecoin started in 2013 as a joke -- a nod to the \"doge\" meme that was all over the internet at the time. But it's no longer a joke: It's the fifth-largest cryptocurrency in the world, with a market value just south of $70 billion, according to Coinbase.Both dogecoin and Tesla had been trading higher in anticipation of Musk's SNL appearance. Tesla futures weren't trading Saturday night during the show.It's unclear what was driving the dogecoin selloff. Perhaps investors wanted Musk to say something more supportive of the cryptocurrency. But more likely, there was some \"buy the rumor / sell the news\" strategy, trying to capitalize on investors' predictions coming true by selling high.Dogecoin traded so actively that Robinhood announced early Sunday morning it was having issues processing crypto trades and was working to resolve the problem..The total value of the dogecoins in circulation is nearly $50 billion — not bad for a digital currency that started as a joke.It is the No. 5 most-valuable cryptocurrency on the market, according to CoinMarketCap, having increased more than 6,000% this year. The price of a dogecoin doubled again Friday after Tesla (TSLA) CEO Elon Musk tweeted about it for the umpteenth time (more on that in a bit). Demand for Dogecoin spiked so much in April, it briefly broke Robinhood's cryptocurrency trading system. What is dogecoin?Like all cryptocurrencies, dogecoin is a digital currency that can be bought and sold like an investment and spent like money.Although each crypto is unique, it shares some similarities with its better-known peers — its code is based off the script for litecoin, for example. But it has a couple key differences. Unlike bitcoin, which has set 21 million as the finite amount of the digital currency, dogecoin has 129 billion coins in circulatIon and will continue to make new blocks of coins available to mine each year. That's part of the reason one dogecoin is currently valued at about three dimes and a bitcoin is worth about $62,000.Although cryptos are gaining more acceptance as a currency for purchasing goods, dogecoin doesn't have much mainstream real-world use. It has a few niche markets, including using dogecoin to tip online artists. And its main differentiator — its active online community — is what makes the odd-ball currency so fun. The group, which is active on Reddit, has raised money (in dogecoin, of course) for charitable causes, and in 2014 it successfully crowdfunded a sponsorship to get Nascar driver Josh Wise to advertise dogecoin on his car.\"Dogecoin is not so much an alternative deflationary numismatic instrument as it is an inflationary leisured exploration of community-building around a cryptoasset,\" wrote Usman Chohan, economist at the University of New South Wales Business School, in a paper updated in February about the digital currency.How did it start?Dogecoin was created December 6, 2013, by a pair of software engineers as a joke.Billy Markus, an IBM programmer from Portland, Oregon, set to differentiate his crypto from bitcoin, which was steeped in mystery with an anonymous creator and at the time attracted a small, niche group of miners. Markus wanted his cryptocurrency to be open to the masses, according to Chohan.Markus looked for help making his weird dream a reality and found Jackson Palmer, who worked for Adobe (ADBE). Palmer purchased the domain dogecoin.com — a nod to the \"doge\" meme that was all over the internet at the time.The website nods to its joke origins at the very top: Its Shiba Inu mascot is the first image on the page, mimicking the meme that inspired it, which features the same dog surrounded by a bunch of Comic Sans text in broken English. On dogecoin.com, its mascot is captioned: \"Dogecoin is an open source peer-to-peer digital currency, favored by Shiba Inus worldwide.\"Why is is so popular, all the sudden?Dogecoin is no longer a joke. Its popularity has soared — astronomically, this year — buoyed in part by the mainstream adoption of bitcoin and other cryptocurrencies.But Elon Musk is the loudest and most prominent supporter of dogecoin. One of his bizarre tweets to his 50 million followers can send the crypto surging. That's what happened in April, when Musk tweeted \"Doge Barking at the moon\" and shared a photo of a painting by Spanish artist Joan Miró, which is titled \"Dog Barking at the Moon.\"Dogecoin has also enjoyed something of a cult status on internet message board Reddit, where a popular group — not unlike the WallStreetBets group behind GameStop's rally — decided earlier this year to propel its value \"to the moon.\" Dogecoin soared over 600% in the wake of that push.Whether or not its a smart investment remains an active question. The more-actively traded and more-widely accepted bitcoin is subject to extreme volatility, so dogecoin, too, could crumble without warning. But its rise this year has been stunning.Not benefiting from the coin's soaring growth is Markus, who sold all his dogecoin when he was laid off in 2015. He used it to buy a Honda Civic..But even after a nearly 10% price spike Tuesday — from about 46 cents to around 50 cents per coin— dogecoin is still trading well below the levels it hit just before Musk's \"Saturday Night Live\" appearance a few days ago.Dogecoin prices were north of 70 cents early Saturday and had pulled back a bit to around 65 cents just before the show aired. But instead of hyping dogecoin, as many backers had hoped, Musk poked fun at it in a bit with his mom in the opening monologue — and again in a \"Weekend Update\" segment in which he played a fictitious financial expert named Lloyd Ostertag who called dogecoin a \"hustle.\" The cryptocurrency promptly fell about 20% to 51 cents just after the show and kept sliding to about 44 cents Sunday morning before recovering a bit.The post-\"SNL\" slide shows how fraught dogecoin's rise has been. The show is a comedy series, not an infomercial, and anyone expecting Musk would be allowed to heap breathless praise on the cryptocurrency and not joke about it clearly miscalculated. Damage controlEven so, Musk now appears to be doing some damage control, reminding investors that he is open to taking payments in dogecoin as well as in crypto leader bitcoin, which Tesla (TSLA) already accepts as payment for its vehicles and holds on its balance sheet.In addition to polling followers Tuesday about the possibility of letting customers buy a Model S, 3, X or Y vehicle with doge, Musk's other well-known company, SpaceX, just revealed it will allow a customer launching a payload on an upcoming lunar mission to pay in dogecoin.That news helped the cryptocurrency bounce off the low it hit Sunday. But it begs the question whether the pre-\"SNL\" price for dogecoin, which now has a total worth of $65 billion and is the world's fourth most valuable cryptocurrency, will turn out to be its peak.Of course, anyone holding dogecoin for the past few months has little to complain about. The price has surged more than 10,000% so far in 2021.But in the rapidly changing world of cryptocurrencies, investors always have some other shiny new coin to explore.There's even an alternative canine-themed coin, the Shiba Inu, which has soared nearly 2,000% in just the past week and now has a market value of about $13 billion. Shiba Inu is the Japanese breed of dog that has become the face of many dogecoin memes.And a brand new crypto that launched this week, Internet Computer (ICP), has stormed out of the gate and is already worth nearly $50 billion. That makes ICP, a token similar to ethereum, the world's eighth-largest cryptocurrency.  .The canine-themed digital currency soared more than 25% Wednesday to about 40 cents. Investors cheered the news that crypto giant Coinbase (COIN) was planning to let users of its Coinbase Pro service buy and sell dogecoin.By Wednesday night, Dogecoin had reached 42 cents, according to Coinbase.\"One of the most common requests we receive from customers is to be able to trade more assets on our platform,\" Coinbase said in a blog post Tuesday. The company added that dogecoin trading is only on its advanced Coinbase Pro product for now and is not yet available for the more standard Coinbase.com site or any of its consumer mobile apps.\"We will make a separate announcement if and when this support is added,\" the company said.Dogecoin has been extremely volatile for the past month, just like bitcoin, ethereum and other cryptocurrencies. Prices hit a peak of 74 cents on May 8, just before Tesla (TSLA) CEO (and huge dogecoin fan) Elon Musk joked on \"Saturday Night Live\" that the cryptocurrency was a \"hustle.\"But Musk is cheering the dogecoin comeback. Following the Coinbase announcement, Musk resurfaced a tweet of his from last July that showed a gigantic cloud with a dog's face on it and the text \"dogecoin standard\" that was approaching a landscape labeled \"global financial system.\"Musk's comment: \"It's inevitable.\".The virtual currency, which originally started as an internet parody based on a viral dog meme, has skyrocketed 373% in the last 24 hours, according to Coinbase. At one point, it was up 613%. One dogecoin is now worth a mere $0.0469, but that's still easily at record levels.It's the latest bizarre twist in the retail investing revolt making front pages all over the world. The surge came after a popular Reddit forum — not unlike the WallStreetBets group behind GameStop's rally — set its sights on pumping up the digital currency. The forum SatoshiStreetBets has featured scores of users calling for a dogecoin rally over the past day. Satoshi refers to Satoshi Nakamoto, the screen name of the self-proclaimed inventor of bitcoin.Users are urging others to buy in, declaring they could propel the cryptocurrency's value \"to the moon.\"For hours, the page was flooded with memes and images of a shiba inu, the dog breed at the center of the internet meme that inspired dogecoin. One user called for a \"coordinated\" buy-in at 9 p.m. US Central time. Others called on investors in India and Europe to help prop up the virtual currency during US overnight hours. Even Elon Musk got in on the action, on Thursday tweeting a photo of a fake magazine cover titled \"Dogue\" instead of \"Vogue.\" The Tesla CEO has engaged in similar banter before. Last month, he spread the word about the cryptocurrency, tweeting: \"One word: Doge.\" He even temporarily updated his Twitter bio to read: \"Former CEO of Dogecoin.\"Months before, Musk tweeted another image of dogecoin, sending the price up 14%.The excitement this week has been palpable. Dogecoin's market cap has soared 380% over the past 24 hours, and currently stands at $6.9 billion, according to cryptocurrency tracker CoinMarketCap. Its trading volume has surged 2,200% in the same time period.\"Let's get Elon to shill for us,\" one Reddit user wrote.\"It's up to us to decide what DOGE is worth,\" said another user. \"And I'm not selling for pennies.\".After much fanfare, anticipation and some controversy, the eccentric tech billionaire took the stage at Studio 8H as host of \"Saturday Night Live\" on Saturday. \"It's an honor to be hosting 'Saturday Night Live. I mean that,\" Musk said. \"Sometimes after I say something, I have to say, 'I mean that,' so people really know that I mean it.\"Musk, who is the CEO of Tesla and one of the richest people on the planet, didn't waste any time jumping into jokes about his Twitter account, smoking weed with Joe Rogan, and his son's name, \"X Æ A-12.\"\"It's pronounced cat running across keyboard,\" he said of his son's name.Musk wasn't alone on stage, however. The CEO brought out his mother Maye during his monologue since Sunday is Mother's Day.\"I'm excited for my mother's day gift. I just hope it's not dogecoin,\" Musk's mother said mentioning the cryptocurrency, which Musk has been a vocal supporter of.\"It is,\" Musk said, smiling. \"It sure is.\"Musk's monologue covered a bunch of subjects but he seemed comfortable, which says a lot considering he's not an actor or comedian. Musk is a surprising choice for the show given that \"SNL\" is not known for picking hosts from the tech or business world. The selection also raised some eyebrows, including with some castmembers signaling their displeasure at the choice, since Musk has courted controversy in the past.Musk spoke a little bit about his erratic comments while making jokes to kick off the show.For example, he shared his vision for the future with the audience saying that he believes in a renewable energy future and that humans have to become a multi-planet civilization.\"Those seem like exciting goals, don't they?\" he said. \"Now think, if I just posted that on Twitter, I'd be fine.\"Musk added that he knows that sometimes he says or posts strange things, but said that's how his brain works and revealed that he has Asperger's syndrome.\"To anyone I've offended, I just want to say, I reinvented electric cars and I'm sending people to Mars in a rocket ship,\" Musk said. \"Did you also think I was going to be a chill normal dude?\"Musk also starred in sketches including one where he played a doctor in \"Gen Z Hospital,\" another where he played the Nintendo character Wario, and he also came up during the show's \"Weekend Update.\"\"I don't know if you guys were following the news today, but a space rocket that was spinning out of control just minutes ago crashed into the ocean,\" castmember Colin Jost said. \"And for once we know it's not Elon's fault.\"Jost added that \"a lot of people have been wondering, 'why is he hosting our show?'\"\"Now we know, it's because he needed an alibi,\" Jost said.Saturday's \"SNL\" was also notable because it was the first time the show has ever been live-streamed internationally. YouTube streamed it live in more than 100 countries, including Australia, Canada, India, Mexico, Russia and the United Kingdom, NBC announced on Saturday..The virtual currency, which features the face of a Shiba Inu dog as its logo, soared more than 100% to hit an all-time high of $0.298 Friday morning, according to cryptocurrency news and data provider Coindesk. This comes just two days after it had surpassed ten cents in value for the first time as investors geared up for the direct listing of cryptocurrency exchange Coinbase Global. The latest boost comes after Tesla (TSLA) CEO Elon Musk, Dogecoin's most important fan, said \"Doge Barking at the moon\" in a tweet. He also shared a photo of a painting by Spanish artist Joan Miró, which is titled \"Dog Barking at the Moon.\"This isn't the first time Musk's tweets have raised the value of Dogecoin, which started as an internet parody more than seven years ago. In February, a series of tweets by the tech billionaire — who has more than 50 million followers on Twitter — had sent the bitcoin rival up more than 50% in trading.\"Dogecoin is the people's crypto,\" he tweeted at the time. Musk had previously been critical of the more established bitcoin, once calling it \"BS\" in a tweet. But in a February interview on social app Clubhouse, Musk said he should have bought that digital currency eight years ago. His company Tesla is also allowing customers to buy cars with bitcoin. Dogecoin has also enjoyed something of a cult status on internet message board Reddit, where a popular group — not unlike the WallStreetBets group behind GameStop's rally — decided earlier this year to propel its value \"to the moon.\" Dogecoin soared over 600% in the wake of that push. At the time of publishing, the currency was trading at $0.26 and had reached a total market value of $32 billion. Even though it started as a joke cryptocurrency in 2013 — inspired by an Internet meme in which \"doge\" became another term for \"dog\" — it has soared more than 5,000% since the start of the year..The virtual currency, which originally started as an internet parody more than seven years ago, has surged more than 85% in the last 24 hours and is trading at $0.13, according to CoinDesk. Its market cap is now over $17 billion. The latest surge comes as investors gear up for the direct listing of cryptocurrency exchange Coinbase Global, which could further help validate crypto buying and selling as a business. Bitcoin also rocketed to a new record above $62,700 this week ahead of that listing, and other cryptocurrencies have also enjoyed big gains. But Dogecoin's rise is noteworthy. The currency has soared more than 2,000% from the start of the year, and has a big fan in Tesla CEO Elon Musk, whose tweets about it have on occasion driven up Dogecoin's value.Dogecoin has also enjoyed something of a cult status on Reddit, where a popular group — not unlike the WallStreetBets group behind GameStop's rally — decided earlier this year to propel its value \"to the moon.\" Dogecoin soared over 600% in the wake of that push.Musk is Dogecoin's richest fan, but he has previously been critical of the more established bitcoin, once calling it \"BS\" in a tweet. In a February interview on social app Clubhouse, though, Musk said he should have bought that digital currency eight years ago. His company Tesla has also promised customers that they can buy their cars with bitcoin.Coinbase, meanwhile, is set for its debut Wednesday. The company is profitable and has reported strong revenue growth.Based on recent private stock trades for Coinbase, the company is valued at a stunning level of nearly $68 billion. To put that into context, it's a little bit more than the market value of New York Stock Exchange owner Intercontinental Exchange (ICE).-- Paul R. La Monica and Charles Riley contributed to this report..A Canadian company called the Geometric Energy Corporation confirmed that it will pay SpaceX solely in dogecoin in order to secure a spot for an 88-pound satellite on a mission, called Doge-1, slated to take off in early 2022. The satellite will \"obtain lunar-spatial intelligence from sensors and cameras,\" according to a press release.\"This is not a joke,\" Geometric Energy Corporation CEO Samuel Reid said via phone. He declined further comment about the deal.Dogecoin, however, did start as a joke: The digital currency was founded by two software engineers in 2013, and its value and popularity are inextricably linked to internet memeworthiness and viral social media posts. Still, dogecoin has been propelled into one of the most popular cryptocurrencies on the market, and it counts SpaceX CEO Elon Musk as one of its most vehement and popular supporters. He's frequently shared dogecoin-centric jokes on Twitter and claimed the cryptocurrency is \"underestimated.\"The announcement that Musk's space company would accept dogecoin as payment came the day after the CEO's appearance on \"Saturday Night Live\" appeared to trigger a sell-off of the currency. Musk said during a segment on the show that the coin was \"a hustle,\" and the coin's trading price later plunged 40%. Still, the cryptocurrency has been on an absolute tear this year: It's up more than 12,000% since January and has gained 800% this month alone. It's unclear what was driving the dogecoin sell-off. Perhaps investors wanted Musk to say something more supportive of the cryptocurrency. But more likely, there was some \"buy the rumor, sell the news\" strategy, where traders buy an asset based on speculation in advance of an event and sell it after the event occurs.Dogecoin traded so actively that the popular trading app Robinhood announced early Sunday morning it was having issues processing crypto trades and was working to resolve the problem.SpaceX did not respond to requests for additional information about its deal with the Geometric Energy Corporation and its planned moon mission. But the company's vice president of commercial sales, Tom Ochinero, said in a statement that the mission intends to \"demonstrate the application of cryptocurrency beyond Earth orbit and set the foundation for interplanetary commerce.\"\"Indeed, through this very transaction, DOGE has proven to be a fast, reliable, and cryptographically secure digital currency that operates when traditional banks cannot and is sophisticated enough to finance a commercial Moon mission in full,\" the press release reads. \"It has been chosen as the unit of account for all lunar business between SpaceX and Geometric Energy Corporation and sets precedent for future missions to the Moon and Mars.\"Geometric Space Corporation states on its website that it was founded in 2015 and is primarily intellectual property, manufacturing and logistics company focused on renewable energy. But it recently launched a new division, called \"Geometric Space Corporation,\" that focuses on organizing rideshares to space for small satellites. The company announced a separate deal with SpaceX, for example, to send a bundle of satellites on a ride share mission to low-Earth orbit in June of 2022. .Ethereum, or ether for short, hit a new record high of above $4,100 Monday morning. Ether is the world's second most valuable cryptocurrency, trailing only bitcoin (XBT). It has soared 465% so far this year — and more than 30% in just the past week — thanks in large part to the fact that it's the currency of choice behind popular non-fungible token (NFT) transactions that have taken the art and sports collectible worlds by storm. Ether is quickly catching up to bitcoin in market value too. All of the ethereum currently in circulation are worth about $480 billion, while bitcoin's market cap is just over $1 trillion. Bitcoin and ether make up about 63% of the total market value for all cryptocurrencies.Bitcoin has gained traction on Wall Street, particularly as a hedge against inflation and fluctuations in the value of government-backed currencies — almost like a digital gold. PayPal (PYPL) and Square (SQ) also let users buy, sell and hold the crypto. But dogecoin, the Shiba Inu-themed cryptocurrency that Tesla (TSLA) and SpaceX CEO Elon Musk has repeatedly touted (although he quipped on the most recent \"Saturday Night Live\" that it's simply a \"hustle\") is now the world's fourth largest crypto. Still, even after a 10,000% surge this year to a combined value of about $66 billion, dogecoin still makes up less than 3% of the total crypto market. Dogecoin prices have also plunged more than 20% since Musk's SNL appearance...from about 65 cents to just over 50 cents.There are legitimate questions about whether dogecoin has any serious applications for businesses and the broader economy — outside of Musk's orbit that is. Canadian research and development and consulting firm Geometric Energy announced Sunday that it was launching a lunar payload on a SpaceX Falcon 9 rocket and that it was paying in dogecoin. Financial terms of the deal were not disclosed though."